Reports/ххх_ОборотыПоКассе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ххх_ОборотыПоКассе</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АналитикаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикаХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АкцизныеМарки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАкцизнойМарки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КодАкцизнойМарки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ххх_ОборотыПоКассе/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	
	НАстройки=ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ДатаНачала=НАстройки.ПараметрыДанных.Элементы.Найти("Период").Значение.ДатаНачала;
	ДатаОкончания=НАстройки.ПараметрыДанных.Элементы.Найти("Период").Значение.ДатаОкончания;
	
 	ДатаБегунок=ДатаНачала;
	
	
	
	
	ТзСмен=Новый ТаблицаЗначений;
	ТзСмен.Колонки.Добавить("Смена",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0)));
	ТзСмен.Колонки.Добавить("СменаСортировки",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(20)));
	Пока ДатаБегунок<ДатаОкончания Цикл
		стр=ТзСмен.Добавить();
		стр.Смена=Число(Формат(ДатаБегунок,"ДФ=ддММгг"));
		стр.СменаСортировки=Формат(ДатаБегунок,"ДФ=ггММдд");
		ДатаБегунок=ДатаБегунок+60*60*24;
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТзСмен", ТзСмен);
	
	Запрос.Текст=  "ВЫБРАТЬ
	               |	ТзСмен.Смена КАК Смена,
	               |	ТзСмен.СменаСортировки КАК СменаСортировки
	               |ПОМЕСТИТЬ Смены
	               |ИЗ
	               |	&ТзСмен КАК ТзСмен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Смена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ЧекККМ.Дата) КАК Конец,
	               |	МИНИМУМ(ЧекККМ.Дата) КАК Начало
	               |ИЗ
	               |	Документ.ЧекККМ КАК ЧекККМ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Смены КАК Смены
	               |		ПО ЧекККМ.НомерСменыККМ = Смены.Смена
	               |ГДЕ
	               |	ЧекККМ.Проведен";
				   
	выборка=Запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		Конец=Выборка.конец;
		Начало=Выборка.Начало;
	Иначе
		возврат;
	КонецЕсли;	
							   
	Запрос = Новый Запрос;     
	Запрос.УстановитьПараметр("Начало",Начало);
	Запрос.УстановитьПараметр("Конец",Конец);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТзСмен.Смена КАК Смена,
	               |	ТзСмен.СменаСортировки КАК СменаСортировки
	               |ПОМЕСТИТЬ Смены
	               |ИЗ
	               |	&ТзСмен КАК ТзСмен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Смена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПродажиОбороты.ДокументПродажи.НомерСменыККМ КАК ДокументПродажиНомерСменыККМ,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот - ПродажиОбороты.СтоимостьОборот) КАК Скидка,
	               |	ПродажиОбороты.ДокументПродажи.КассаККМ КАК ДокументПродажиКассаККМ,
	               |	Смены.СменаСортировки КАК СменаСортировки
	               |ПОМЕСТИТЬ йцу
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&Начало, &Конец, Авто, ДокументПродажи ССЫЛКА Документ.ЧекККМ) КАК ПродажиОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Смены КАК Смены
	               |		ПО ПродажиОбороты.ДокументПродажи.НомерСменыККМ = Смены.Смена
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.ДокументПродажи.НомерСменыККМ,
	               |	ПродажиОбороты.ДокументПродажи.КассаККМ,
	               |	Смены.СменаСортировки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	йцу.ДокументПродажиНомерСменыККМ КАК НомерСменыККМ,
	               |	йцу.Сумма КАК Сумма,
	               |	йцу.Скидка КАК Скидка,
	               |	йцу.ДокументПродажиКассаККМ КАК КассаККМ,
	               |	йцу.СменаСортировки КАК СменаСортировки,
	               |	йцу.ДокументПродажиКассаККМ.Наименование КАК ДокументПродажиКассаККМНаименование
	               |ИЗ
	               |	йцу КАК йцу
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СменаСортировки,
	               |	ДокументПродажиКассаККМНаименование";
	//Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ТзСмен", ТзСмен);
 
	ТЗ = Запрос.Выполнить().Выгрузить() ;
	
	
		
					
	//// Например чет там делаем, чего в запросе нельзя намутить
	//Для Каждого Стр Из ТЗ Цикл
	//	
	//	
	//КонецЦикла;
			
	//Связь между таблицей значений и именами в СКД 
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("НаборДанных1", ТЗ);
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НАстройки, ДанныеРасшифровки);
	
	//Компоновка данных 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	//Вывод результата 
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры
